<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Default Mailer
    |--------------------------------------------------------------------------
    |
    | Цей параметр керує розсилкою за замовчуванням, яка використовується для надсилання будь-якої електронної пошти
    | повідомлення, надіслані вашою програмою. Можуть бути налаштовані альтернативні розсилники
    | і використовується в міру необхідності; однак цей лист буде використовуватися за замовчуванням.
    |
    */

    'default' => env('MAIL_MAILER', 'smtp'),

    /*
    |--------------------------------------------------------------------------
    | Mailer Configurations
    |--------------------------------------------------------------------------
    |
    | Тут ви можете налаштувати всі поштові програми, які використовує ваша програма,
    | а також їх відповідні налаштування. Для вас було налаштовано кілька прикладів, 
    | і ви можете додати свої власні, як того вимагає ваша програма.
    |
    | Laravel підтримує різноманітні драйвери «транспортування» пошти, які можна використовувати під час
    | надсилання електронного листа. Ви вкажете, який з них ви використовуєте для свого
    | листівки нижче. За потреби ви можете додавати додаткові листівки.
    |
    | Supported: "smtp", "sendmail", "mailgun", "ses",
    |            "postmark", "log", "array", "failover"
    |
    */

    'mailers' => [
        'smtp' => [
            'transport' => 'smtp',
            'host' => env('MAIL_HOST', 'smtp.mailgun.org'),
            'port' => env('MAIL_PORT', 587),
            'encryption' => env('MAIL_ENCRYPTION', 'tls'),
            'username' => env('MAIL_USERNAME'),
            'password' => env('MAIL_PASSWORD'),
            'timeout' => null,
            'auth_mode' => null,
        ],

        'ses' => [
            'transport' => 'ses',
        ],

        'mailgun' => [
            'transport' => 'mailgun',
        ],

        'postmark' => [
            'transport' => 'postmark',
        ],

        'sendmail' => [
            'transport' => 'sendmail',
            'path' => env('MAIL_SENDMAIL_PATH', '/usr/sbin/sendmail -t -i'),
        ],

        'log' => [
            'transport' => 'log',
            'channel' => env('MAIL_LOG_CHANNEL'),
        ],

        'array' => [
            'transport' => 'array',
        ],

        'failover' => [
            'transport' => 'failover',
            'mailers' => [
                'smtp',
                'log',
            ],
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Global "From" Address
    |--------------------------------------------------------------------------
    |
    | Ви можете побажати, щоб усі електронні листи, надіслані вашою заявкою, надсилалися з
    | ту саму адресу. Тут ви можете вказати назву та адресу
    | використовується глобально для всіх електронних листів, які надсилає ваша програма.
    |
    */

    'from' => [
        'address' => env('MAIL_FROM_ADDRESS', 'clothes.shop@domain.com'),
        'name' => env('MAIL_FROM_NAME', 'Example'),
    ],

    /*
    |--------------------------------------------------------------------------
    | Markdown Mail Settings
    |--------------------------------------------------------------------------
    |
    | Якщо ви використовуєте рендеринг електронної пошти на основі Markdown, ви можете налаштувати свій
    | шляхи теми та компонентів тут, що дозволяє налаштувати дизайн
    | електронних листів. Або ви можете просто дотримуватися стандартних значень Laravel!
    |
    */

    'markdown' => [
        'theme' => 'default',

        'paths' => [
            resource_path('views/vendor/mail'),
        ],
    ],

];
